import z, { string } from "zod";
export const contactUsSchema = z.object({
  name: string()
    .trim()
    .min(2, "نام و نام خانوادگی باید حداقل 2 کارکتر باشد")
    .max(20, "نام و نام خانوادگی حداکثر میتواند 20 کرکاتر باشد"),

  phone: string().trim().regex(/[0-9]/, "شماره تلفن میتواند فقط شامل عدد باشد"),
  subject: string()
    .trim()
    .min(3, "عنوان باید حداقل 3 کارکتر باشد")
    .max(20, "عنوان حداکثر میتواند 20 کارکتر باشد"),
  content: string("متن محتوان نمیتواند خالی باید")
    .trim()
    .min(10, "محتوا باید حداقل 10 کارکتر باشد")
    .max(500, "محتوا حداکثر میتواند 500 کرکتر باشد"),
});
